import { Injectable } from '@angular/core';


@Injectable({
  providedIn: 'root'
})
export class ProductService {

  constructor() { }

  computerProductsInMainPage = [
    {
      id : 1 ,
      title : "توسعه دهنده کامپیوتر و تایپ اسکریپت" ,
      price : "120,000",
      creator : "آنتون مویسو",
      type : "computers book",
      image : ".././../assets/product-images/Fain-Angular-2ed-HI.png",
      Discount : "25%",
      about : "Angular Development with TypeScript، Second Edition به شما آموزش می دهد که چگونه برنامه های وب را با Angular و TypeScript بسازید. این راهنمای روشنگر که به سبکی در دسترس و پر جنب و جوش نوشته شده است، نگرانی های اصلی مانند مدیریت وضعیت، داده ها، فرم ها و ارتباطات سرور را در حین ساختن یک برنامه حراج آنلاین با امکانات کامل پوشش می دهد."
   },
    {
      id : 2 ,
      title : " شما js را نمی شناسید " ,
      price : "89,000",
      creator : "کایله سیمپسون",
      type : "computers book",
      image : ".././../assets/product-images/91dn7PZgDGL._AC_UL900_SR615,900_.jpg",
      Discount : "15%",
      about : "آموزش حضوری محتوای این کتاب‌ها عمدتاً از مجموعه‌ای از مواد آموزشی که من به صورت حرفه‌ای تدریس می‌کنم (در قالب کارگاه عمومی و خصوصی-شرکتی) نشأت می‌گیرد: کارگاه‌های آموزشی «مبانی جاوا اسکریپت عمیق»، «بازاندیشی Async» و «ES6: The Right Parts». اگر این محتوا را دوست دارید و می خواهید با من در رابطه با انجام آموزش در مورد این یا سایر موضوعات مختلف JS/HTML5/node.js با من تماس بگیرید، لطفاً از طریق ایمیل با من تماس بگیرید: getify @ gmail آموزش ویدیویی آنلاین من همچنین برخی از مواد آموزشی JS را در قالب ویدیوی درخواستی در دسترس دارم. من دوره هایی را از طریق Frontend Masters تدریس می کنم، مانند کارگاه Deep JavaScript Foundations. شما می توانید تمام دوره های من را اینجا پیدا کنید. برخی از این دوره‌ها بر روی پلتفرم‌های دیگر مانند Pluralsight، Lynda.com و O'Reilly Safari Online نیز توزیع می‌شوند."
   },
    {
      id : 3 ,
      title : "بخش های خوب جاوا اسکریپت" ,
      price : "135,000",
      creator : "داگلاس کراکفورد",
      type : "computers book",
      image : ".././../assets/product-images/81kqrwS1nNL.jpg",
      Discount : "20%",
      about : "اکثر زبان‌های برنامه‌نویسی دارای بخش‌های خوب و بد هستند، اما جاوا اسکریپت بیش از سهم خود از بدی‌ها دارد، زیرا قبل از اصلاح، با عجله توسعه و منتشر شده است. این کتاب معتبر این ویژگی‌های بد را حذف می‌کند تا زیرمجموعه‌ای از جاوا اسکریپت را نشان دهد که قابل اعتمادتر، خواناتر و قابل نگهداری‌تر از کل زبان است - زیرمجموعه‌ای که می‌توانید برای ایجاد کد واقعاً توسعه‌پذیر و کارآمد از آن استفاده کنید. نویسنده داگلاس کراکفورد که توسط بسیاری از افراد در جامعه توسعه به عنوان متخصص جاوا اسکریپت در نظر گرفته می شود، ایده های فراوانی را شناسایی می کند که جاوا اسکریپت را به یک زبان برنامه نویسی شی گرا برجسته می کند، ایده هایی مانند توابع، تایپ آزاد، اشیاء پویا و نماد لغوی شی بیانگر. متأسفانه، این ایده‌های خوب با ایده‌های بد و وحشتناک کاملاً مانند یک مدل برنامه‌نویسی مبتنی بر متغیرهای جهانی مخلوط شده‌اند. هنگامی که اپلت های جاوا شکست خوردند، جاوا اسکریپت به طور پیش فرض به زبان وب تبدیل شد و محبوبیت آن تقریباً کاملاً مستقل از کیفیت آن به عنوان یک زبان برنامه نویسی شد. در JavaScript: The Good Parts، کراکفورد در نهایت به انبوهی از نیت های خوب و اشتباهات می پردازد تا به شما نگاهی دقیق به تمام بخش های واقعاً ظریف جاوا اسکریپت بدهد، از جمله: نحو اشیاء کارکرد وراثت آرایه ها عبارات با قاعد مواد و روش ها سبک ویژگی های زیبا زیبایی واقعی؟ همانطور که با زیرمجموعه جاوا اسکریپت که این کتاب ارائه می‌کند پیش می‌روید، نیاز به فراموش کردن همه قسمت‌های بد را نیز نادیده می‌گیرید. البته، اگر می‌خواهید در مورد قسمت‌های بد و نحوه استفاده بد از آنها اطلاعات بیشتری کسب کنید، به سادگی با هر کتاب جاوا اسکریپت دیگری مشورت کنید."
   },
   {
    id : 4 ,
    title : "کتاب آشپزی برنامه نویس PHP" ,
    price : "90,000",
    creator : "استرلینگ هیوقس",
    type : "computers book",
    image : ".././../assets/product-images/41-MW9mDuWL._AC_UF894,1000_QL80_.jpg",
    Discount : "10%",
    about : " کتاب آشپزی توسعه‌دهنده PHP، نسخه دوم کتابی وظیفه‌محور است که برای ارائه راه‌حل‌هایی برای مشکلات و اهداف روزانه که توسعه‌دهندگان PHP با آن روبرو هستند، طراحی شده است. علاوه بر مقدمه ای کوتاه بر PHP، محتوای اصلی کتاب که به صورت منطقی بر اساس موضوع به موضوع سازماندهی شده است، در قالب مسئله و راه حل ارائه شده است. هر سوال یک هدف را مشخص می کند و متن زیر راه حل مفصلی را ارائه می دهد که به هدف اعلام شده همراه با اطلاعات اضافی مرتبط می رسد. پس از یک دوره کوتاه در اصول اولیه، کتاب آشپزی توسعه‌دهنده PHP، نسخه دوم موضوعات توسعه پیشرفته‌تری را پوشش می‌دهد."
  },
    {
      id : 5 ,
      title : " الگوهای طراحی جاوا اسکریپت" ,
      price : "80,000",
      creator : "آدی عثمانی",
      type : "computers book",
      image : ".././../assets/product-images/91WlvEND3rL._AC_UF1000,1000_QL80_.jpg",
      Discount : "10%",
      about : "با آموزش الگوهای طراحی جاوا اسکریپت، یاد خواهید گرفت که چگونه با استفاده از الگوهای طراحی کلاسیک و مدرن در زبان، جاوا اسکریپت زیبا، ساختار یافته و قابل نگهداری بنویسید. اگر می‌خواهید کد خود را کارآمد، قابل مدیریت‌تر و به‌روز با آخرین بهترین روش‌ها نگه دارید، این کتاب برای شما مناسب است.     بسیاری از الگوهای طراحی محبوب، از جمله ماژول ها، مشاهده گرها، نماها و واسطه ها را کاوش کنید. بیاموزید که چگونه الگوهای معماری مدرن - مانند MVC، MVP و MVVM - از دیدگاه یک توسعه‌دهنده برنامه وب مدرن مفید هستند. این کتاب همچنین توسعه‌دهندگان با تجربه جاوا اسکریپت را در قالب‌های ماژول مدرن، نحوه کدگذاری فضای نام به طور موثر و سایر موضوعات ضروری راهنمایی می‌کند.  ساختار الگوهای طراحی و نحوه نگارش آنها را بیاموزید دسته بندی های مختلف الگو از جمله خلقی، ساختاری و رفتاری را درک کنید بیش از 20 الگوی طراحی کلاسیک و مدرن را در جاوا اسکریپت مرور کنید از چندین گزینه برای نوشتن کد مدولار استفاده کنید - از جمله الگوی ماژول، تعریف ماژول ناهمگام (AMD) و CommonJS الگوهای طراحی پیاده سازی شده در کتابخانه jQuery را کشف کنید الگوهای طراحی محبوب برای نوشتن پلاگین های قابل نگهداری jQuery را بیاموزید "
    },
    
    {
      id : 6 ,
      title : "  یادگیری کتابخانه ری اکت" ,
      price : "140,000",
      creator : "الکس بانکس",
      type : "computers book",
      image : ".././../assets/product-images/Best_React_Books_Learning_React_by_Alex_Banks_and_Eve_Porcello_2_11zon_98b601256f.webp",
      Discount : "25%",
      about :"React JS یک کتابخانه جاوا اسکریپت است که در درجه اول برای ایجاد رابط کاربری استفاده می شود  کتابخانه های جاوا اسکریپت مجموعه ای از کدها هستند که با ارائه ابزارهای لازم برای توسعه دهندگان به توسعه وب سایت های تعاملی کمک می کنند.  ایجاد رابط های کاربری تعاملی را تسهیل می کند و از پشتیبانی گسترده بسیاری از رهبران صنعت مانند فیس بوک (اکنون متا)، اینستاگرام، نتفلیکس، Airbnb و غیره برخوردار است. بسیاری از این شرکت ها حتی چارچوب خود را بر اساس React ایجاد کردند که شامل تمام ویژگی های لازم برای رابط کاربری است. طرح. React توسط فیس‌بوک (اکنون متا) در سال 2013 منتشر شد و آخرین نسخه React 18 در زمان نگارش مقاله (در ماه می 2022) است. می توانید از React برای توسعه برنامه های وب تعاملی، وب سایت ها و برنامه های تلفن همراه استفاده کنید"
    },

    {
      id : 7 ,
      title : " آموزش نکست جی اس " ,
      price : "100,000",
      creator : "آدام بودوچ",
      type : "computers book",
      image : ".././../assets/product-images/Boduch-Next-MEAP-HI.png",
      Discount : "",
      about : "Next.js in Action یک راهنمای بدون اصطلاحات تخصصی برای ساخت برنامه های وب ارائه شده توسط سرور با React و Next.js است. در آن، نویسنده Adam Boduch با مبانی Next.js و تفاوت آن با سایر چارچوب ها شروع می کند. پس از آن اولین لحظه لامپ شما فرا می رسد: با ساختن اجزای صفحه قابل استفاده مجدد و سریع با راه حل های طراحی خارج از جعبه Next.js چقدر در زمان صرفه جویی خواهید کرد. فصل به فصل، وقتی یاد می گیرید که چگونه قطعات متحرک یک برنامه Next.js با هم قرار می گیرند، یک برنامه پیام رسان ایجاد خواهید کرد. در نهایت، یاد خواهید گرفت که از Next.js برای حل چالش‌های باطن خود، از انتزاع کردن جزئیات مسیریابی و نقاط پایانی API تا استقرار بسیار ساده در فضای ابری، استفاده کنید."
   },
    {
      id : 8 ,
      title : " پروژه های انگولار" ,
      price : "110,000",
      creator : "مارک تامپسون",
      type : "computers book",
      image : ".././../assets/product-images/n7xb6wcjqdjojdcqtfyy.jfif",
      Discount : "25%",
      about : "خب، Angular یک پلت فرم برنامه وب پیش‌فرض منبع باز مبتنی بر TypeScript است که توسط تیم Angular در Google و توسط جامعه‌ای از افراد و شرکت‌ها رهبری می‌شود تا در حین ساخت برنامه‌های پیچیده وب، به تمام بخش‌های گردش کار توسعه‌دهنده رسیدگی کند. Angular یک بازنویسی کامل از همان تیم سازنده AngularJS است این یک چارچوب برای ساخت برنامه های مشتری در HTML و جاوا اسکریپت یا زبانی مانند TypeScript است که به جاوا اسکریپت کامپایل می شود. Angular همچنین الگوهای اعلامی، تزریق وابستگی، ابزارهای انتها به انتها و بهترین شیوه های یکپارچه را برای حل چالش های توسعه ترکیب می کند. علاوه بر این، Angular به توسعه دهندگان این امکان را می دهد تا برنامه هایی را بسازند که روی وب، موبایل یا دسکتاپ زندگی می کنند."
   },
    {
      id : 9 ,
      title : " آموزش پایتون برای مبتدی  " ,
      price : "80,000",
      creator : "مارک رد",
      type : "computers book",
      image : ".././../assets/product-images/Python-Programming-for-Beginners-cover.jpg",
      Discount : "",
      about : "چه غیر برنامه نویس باشید و چه از قبل با برنامه نویسی آشنا هستید، این کتاب عالی دیگری است که به شما کمک می کند اولین گام ها را در پایتون بردارید و بیشترین بهره را از آن ببرید. آنچه را که در عنوان وعده داده است ارائه می دهد: راهنمای گام به گام برای یادگیری پایتون به روشی سریع و آسان.  چیزی که ما واقعاً در مورد این کتاب دو جلدی دوست داریم این است که تعادل مناسب بین تئوری و عمل را فراهم می کند. در حالی که کتاب اول توضیحات کاملاً تعریف شده و جالبی را ارائه می دهد، کتاب دوم به عنوان یک کتاب کار عمل می کند که آنچه را که تاکنون آموخته اید یکپارچه می کند. علاوه بر این، ماهیت تعاملی راهنما، آن را به یک تجربه یادگیری سرگرم کننده و مؤثر تبدیل می کند."
    },
    {
      id : 10 ,
      title : " آموزش پایتون پیشرفته" ,
      price : "100,000",
      creator : "مارک لویز",
      type : "computers book",
      image : ".././../assets/product-images/519YsN69yEL._SX379_BO1,204,203,200_.jpg",
      Discount : "25%",
      about : "اگر به اصول پایتون تسلط دارید، آماده هستید که از آن برای انجام کار واقعی استفاده کنید. برنامه نویسی پایتون به شما نشان می دهد که چگونه، با آموزش های عمیق در حوزه های کاربردی اصلی زبان: مدیریت سیستم، رابط کاربری گرافیکی و وب. همچنین نحوه استفاده از پایتون در پایگاه‌های داده، شبکه، لایه‌های اسکریپت‌نویسی جلویی، پردازش متن و موارد دیگر را بررسی خواهید کرد. این کتاب بر روی ابزارها و کتابخانه‌های رایج تمرکز دارد تا به شما درک جامعی از نقش‌های متعدد پایتون در برنامه‌نویسی عملی و دنیای واقعی بدهد. شما تکنیک های نحو زبان و برنامه نویسی را به شیوه ای واضح و مختصر، با مثال های زیادی که هم استفاده صحیح و هم اصطلاحات رایج را نشان می دهد، یاد خواهید گرفت. به طور کامل برای نسخه 3.x به روز شده، برنامه نویسی پایتون همچنین به عنوان یک ابزار توسعه نرم افزار، با نمونه های کد زیادی که به طور خاص برای این منظور مقیاس بندی شده اند، به زبان می پردازد."
   },
    
    
  ]
}
